// Дано число обозначающее день недели. Выяснить является номер дня недели выходным

Console.WriteLine("Введите номер дня недели ");
string day = Convert.ToString(Console.ReadLine());
if(day == "1")
{
    Console.WriteLine("День недели рабочий");
}
else if(day == "2")
{
    Console.WriteLine("День недели рабочий");
}
else if(day == "3")
{
    Console.WriteLine("День недели рабочий");
}
else if(day == "4")
{
    Console.WriteLine("День недели рабочий");
}
else if(day == "5")
{
    Console.WriteLine("День недели рабочий");
}
else if(day == "6")
{
    Console.WriteLine("День недели выходной");
}
else if(day == "7")
{
    Console.WriteLine("День недели выходной");
}
